sitemap.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/stylesorg.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.6.0/css/all.min.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Fira+Mono&display=swap">
<link rel="icon" type="image/x-icon" href="/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <a href="/index.html"><h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>mblognl</h2></a>
  <div>
    <a href='/about.html' style='font-weight:bold; font-style:italic;'>About Me</a> |
    <a href='/archive.html' style='font-weight:bold; font-style:italic;'>Blog</a> |
    <a href='/books.html' style='font-weight:bold; font-style:italic;'>Books</a> |
    <a href='/rss.xml' style='font-weight:bold; font-style:italic;'>RSS</a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<div id="outline-container-org354d0cb" class="outline-2">
<h2 id="org354d0cb"><a href="notes.html">(2025-02-08) Notes and Drafts</a></h2>
<div class="outline-text-2" id="text-org354d0cb">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org9ab40a9" class="outline-2">
<h2 id="org9ab40a9"><a href="about.html">(2025-02-08) About Me</a></h2>
<div class="outline-text-2" id="text-org9ab40a9">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-orgae1929f" class="outline-2">
<h2 id="orgae1929f"><a href="archive.html">(2025-02-08) Posts Archive</a></h2>
<div class="outline-text-2" id="text-orgae1929f">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-orge4fde62" class="outline-2">
<h2 id="orge4fde62"><a href="books.html">(2024-12-31) Previous Books</a></h2>
<div class="outline-text-2" id="text-orge4fde62">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org7beb223" class="outline-2">
<h2 id="org7beb223"><a href="index.html">(2024-10-03) Welcome to <i>mblognl</i></a></h2>
<div class="outline-text-2" id="text-org7beb223">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org593c7aa" class="outline-2">
<h2 id="org593c7aa">notes</h2>
<div class="outline-text-2" id="text-org593c7aa">
</div>
<div id="outline-container-org359050b" class="outline-3">
<h3 id="org359050b"><a href="notes/notes.html">(2025-02-08) Notes - a place to store</a></h3>
<div class="outline-text-3" id="text-org359050b">
<p>
(No preview)
</p>
</div>
</div>
</div>
<div id="outline-container-org5859855" class="outline-2">
<h2 id="org5859855">posts</h2>
<div class="outline-text-2" id="text-org5859855">
</div>
<div id="outline-container-org3595a5d" class="outline-3">
<h3 id="org3595a5d"><a href="posts/release-monitoring-in-jira.html">(2024-10-11) Release Monitoring with Automation for Jira</a></h3>
<div class="outline-text-3" id="text-org3595a5d">
<p>
So your organisation has decided to build a Internal Developer Portal (IDP) using Backstage. All of a sudden you're responsible for looking after a quickly growing, forever updating production environment, as well as an IDP?
</p>
</div>
</div>
<div id="outline-container-org0955afe" class="outline-3">
<h3 id="org0955afe"><a href="posts/terraform-and-terrascan.html">(2024-10-11) Terraform and Terrascan with AWS (Immersive Labs)</a></h3>
<div class="outline-text-3" id="text-org0955afe">
<p>
This post is going to cover my most recent lab "Secure Terraform for AWS". I wanted to present my personal approach on the lab and my experience in general. I'm going to try not to give away too much, just some hints and what to expect if you're considering purchasing licences or you're a learner considering which labs to do next.
</p>
</div>
</div>
<div id="outline-container-orgaa3177c" class="outline-3">
<h3 id="orgaa3177c"><a href="posts/emacs-ispell-aspell.html">(2024-10-04) Emacs with aspell/ispell on Nix Darwin</a></h3>
<div class="outline-text-3" id="text-orgaa3177c">
<p>
I like writing and was keen to introduce an on-the-fly spellchecker in Emacs. Ispell is built in to the current version I'm using (29.1). However it was locked to the default US dictionary. Easy fix right?</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="postamble" style="text-align: center; margin-top: 20px; margin-bottom: 20px;"> 
               <p> Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)  </p>
               </div>
</div>
</body>
</html>
